 <template>
    <div class="map_content">
    	<div class="topTitle" v-show='istitle'>
            <span>{{nowYear}}年累计接待游客总人次</span>
            <font>{{yearNumbs}}</font>
        </div>
        <div class='topTitle' v-show='istitle'>
            <span>{{mowMonth}}月份持续接待游客总人次</span>
            <font>{{mouthNumbs}}</font>
        </div>
        <div id="fromEchart"></div>

        <div class="week">
             <span class="oneweek " v-bind:class="{ chose: isActive }" @click='redom7' title="省内">省内</span> 
             <span class="twoweek" v-bind:class="{ chose: !isActive }" @click='redom14' title="省外">省外</span> 
        </div>
        <Loading v-show='isloading' class='loading'></Loading>
    </div>
</template>

<script>
import Vue from 'vue'
import { mapGetters } from 'vuex'
import echarts from 'echarts';
import Rw from '@/common/js/until/index'

import echarts_resize from '../../../common/js/echarts_resize.js'
import 'echarts/map/js/china.js';
import zhejiangJson from 'echarts/map/json/province/zhejiang.json'
import optionProps from '@/common/js/mixin/optionProps.js'
import coords from './coords.json'
let date = new Date()
let nowYear = date.getFullYear()
let mowMonth = date.getMonth()+1
var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';
let w = document.body.clientWidth/1920;
export default {
    name: 'a6',
    mixins: [optionProps],
    props:['placeName','istitle'],
    
    data () {
    return {
    	num1:0,
    	num2:0,
    	isloading:true,
    	code:'',
    	range:1,
        yearNumb:0,
        mouthNumb:0,
        nowYear:nowYear,
        mowMonth:mowMonth,
        topCity:[],
        chart:null,
        isActive:false,
        color:['#C184FF','#F95AFD','#5AA7FD','#555FFF','#5AFDD1','#58E5E1','#FFCD38','#FFFD85','#FF8885','#FF43A3'],
        option : {
            backgroundColor: 'rgba(0,0,0,0)',
            tooltip: {
                trigger: 'item',
       formatter:function(params){
                	if(params.seriesType==="effectScatter"){
                    		return params.data.name+" "+params.data.value[2]+' (人次) '
                	}else{
                    		return 
                	}
                }
            },
            geo: {
                map: 'zhejiang',
                label: {
                    emphasis: {
                        show: false
                    }
                },
                roam: true,
                itemStyle: {
                        normal: {
                            color:'#163387',
                            areaColor: '#163387',
                            borderColor:'white',
                            borderWidth:0.5,
                            shadowColor: 'rgba(0, 0, 0, 0.1)',
                            shadowBlur:10,
                            opacity:0.3,
                        },
                        emphasis: {
                            areaColor: '#2a333d'
                        }
                    }
            },

        },
        geoCoordLocal:{
            '浦江县': [120.105537,29.508488],
            '江山市': [118.639502,28.757867],
            '湖州市': [120.091557,30.904757],
            '嘉兴市': [120.763058,30.761869],
            '宁波市': [121.554142,29.89605],
            '绍兴市': [120.583685,30.048225],
            '金华市': [119.650022,29.095307],
            '丽水市':[119.930581,28.483471],
            '台州市': [121.425361,28.670242],
            '温州市': [120.698668,28.015083],
            '舟山市':[122.216445,29.992188],
            '杭州市': [119.5313, 29.8773],
            '衢州市':[118.906032, 28.945182]
        },
        zhejiang:[],
        allData:[],
        optionChina : {
            backgroundColor: 'rgba(0,0,0,0)',
            tooltip: {
                trigger: 'item',
                formatter:function(params){
                	if(params.seriesType==="effectScatter"){
                    		return params.data.name+" "+params.data.value[2]+' (人次) '
                	}else{
                    		return
                	}
                }
            },
            geo: {
                map: 'china',
                label: {
                    emphasis: {
                        show: false
                    }
                },
                roam: true,
                itemStyle: {
                        normal: {
                            color:'#163387',
                            areaColor: '#163387',
                            borderColor:'white',
                            borderWidth:0.5,
                            shadowColor: 'rgba(0, 0, 0, 0.1)',
                            shadowBlur:10,
                            opacity:0.3,
                        },
                        emphasis: {
                            areaColor: '#2a333d'
                        }
                    }
            },
            series: []
        },
        geoCoordMap:{
            '上海市': [121.4648, 31.2891],
            '浦江县': [120.105537,29.508488],
            '江山市': [118.639502,28.757867],
            '湖州市': [120.091557,30.904757],
            '嘉兴市': [120.763058,30.761869],
            '宁波市': [121.554142,29.89605],
            '绍兴市': [120.583685,30.048225],
            '金华市': [119.650022,29.095307],
            '丽水市':[119.930581,28.483471],
            '台州市': [121.425361,28.670242],
            '温州市': [120.698668,28.015083],
            '舟山市':[122.216445,29.992188],
            '杭州市': [119.5313, 29.8773],
            '衢州市':[118.906032, 28.945182],
            
            '开封市':[114.334304, 34.78857],
            '中山市': [113.4229, 22.478],
            '乌鲁木齐市': [87.9236, 43.5883],
            '佛山市': [112.8955, 23.1097],
            '兰州市': [103.5901, 36.3043],
            '包头市': [110.3467, 41.4899],
            '北京市': [116.4551, 40.2539],
            '南京市': [118.8062, 31.9208],
            '厦门市': [118.1689, 24.6478],
            '合肥市': [117.29, 32.0581],
            '呼和浩特市': [111.4124, 40.4901],
            '哈尔滨市': [127.9688, 45.368],
            '大连市': [122.2229, 39.4409],
            '天津市': [117.4219, 39.4189],
            '太原市': [112.3352, 37.9413],
            '广州市': [113.5107, 23.2196],
            '徐州市': [117.5208, 34.3268],
            '惠州市': [114.6204, 23.1647],
            '成都市': [103.9526, 30.7617],
            '拉萨市': [91.1865, 30.1465],
            '无锡市': [120.3442, 31.5527],
            '杭州市': [119.5313, 29.8773],
            '武汉市': [114.3896, 30.6628],
            '南昌市': [116.0046,28.6633],  
            '汕头市': [117.1692, 23.3405],
            '江门市': [112.6318, 22.1484],
            '济南市': [117.1582, 36.8701],
            '上饶市': [117.949478, 28.460729],
            '宣城市':[118.765534, 30.946718],
            '商丘市':[115.662458, 34.420299],
            '安阳市':[114.3995, 36.105985],
            '阜阳市':[115.820427, 32.896107],
            '济宁市': [116.8286, 35.3375],
            '海口市': [110.3893, 19.8516],
            '西宁市':[101.778122,36.622921],
            '深圳市': [114.5435, 22.5439],
            '清远市': [112.9175, 24.3292],
            '渭南市': [109.7864, 35.0299],
            '滨州市': [117.8174, 37.4963],
            '玉溪市': [101.9312, 23.8898],
            '珠海市': [113.7305, 22.1155],
            '石家庄市': [114.4995, 38.1006],
            '秦皇岛市': [119.2126, 40.0232],
            '肇庆市': [112.1265, 23.5822],
            '苏州市': [120.6519, 31.3989],
            '西安市': [109.1162, 34.2004],
            '连云港市': [119.1248, 34.552],
            '郑州市': [113.4668, 34.6234],
            '鄂尔多斯市': [108.9734, 39.2487],
            '重庆市': [107.7539, 30.1904],
            '长春市': [125.8154, 44.2584],
            '长沙市': [113.0823, 28.2568],
            '韶关市': [113.7964, 24.7028],
            '曲靖市':[103.807034, 25.479708],
            '鄂州市':[114.910806, 30.376634],
            '玉林市':[110.197652, 22.634215],
            '咸阳市':[108.711973, 34.333091],
            '芜湖市':[118.427358, 31.356563],
            '临沂市':[118.361808, 35.107364],
            '焦作市':[113.247973, 35.218604],
            '莱芜市':[117.681825, 36.217608],
            '潍坊市':[119.168953, 36.707097],
            '锦州市':[121.130871, 41.102671],
            '衡水市':[115.677131, 37.747474],
            '滁州市':[118.333082, 32.285694],
            '毕节市':[105.321355, 27.288686],
            '抚顺市':[123.96265, 41.88554],
            '南阳市':[112.527027, 32.995109],
            '安顺市':[105.886577, 26.217253],
            '扬州市':[119.369976, 32.395311],
            '淮安市':[119.032407, 33.615333],
            '桂林市':[110.20297, 25.240271],
            '通化市':[125.945456, 41.731663],
            '铁岭市':[123.73179, 42.227811],
            '鹰潭市':[117.069251, 28.263751],
            '盐城市':[120.164669, 33.354619],
            '郴州市':[112.98754, 25.738675],
            '泰州市':[119.911744, 32.510381],
            '衡阳市':[112.59167, 26.893905],
            '常州市':[119.976311, 31.814814],
            '昭通市':[103.725237, 27.336382],
            '定西市':[104.628396, 35.585894],
            '菏泽市':[115.472022, 35.237992],
            '新乡市':[113.913478, 35.301156],
            '东莞市':[113.762444, 23.025712],
            '漳州市':[117.656451, 24.514196],
            '宿州市':[116.975718, 33.652095],
            '贵阳市':[106.641751, 26.652808],
            '亳州市':[115.779289, 33.848724],
            '吕梁市':[111.141826, 37.522208],
            '襄阳市':[112.130262, 32.012348],
            '福州市':[119.302895, 26.077314],
            '黔西南布依族苗族自治州':[104.947562, 25.145265],
            '周口市':[114.704633,33.631829],
            '黔南布依族苗族自治州':[107.516905,26.251284],
            '宁德市':[119.543874,26.67999],
            '晋中市':[112.748957,37.694668],
            '南平市':[118.095428,27.326056],
            '南通市':[120.896129,31.989979],
            '荆州市':[112.25558,30.340843],
            '黄冈市':[114.884526,30.460355],
            '聊城市':[115.995325,36.459972],
            '湛江市':[110.366991,21.277802],
            '淄博市':[118.065192,36.820009],
            '双鸭山市':[131.16448,46.652393],
            '伊犁哈萨克自治州':[131.16448,46.652393],
            '南宁市':[108.376616,22.817277],
            '阿克苏地区':[80.268376,41.17416],
            '鹤岗市':[130.301271,47.354494],
            '孝感市':[113.9205,30.931185],
            '黔东南苗族侗族自治州':[107.98801,26.586603],
            '十堰市':[110.805966,32.637009],
            '晋城市':[112.859727,35.497694],
            '铜仁市':[109.202186,27.739832],
            '恩施土家族苗族自治州':[109.479645,30.351266],
            '吉安市':[114.999939,27.118184],
            '荆门市':[114.999939,27.118184],
            '六盘水市':[104.841002,26.595733],
            '文山壮族苗族自治州':[104.220273,23.409709],
            '平顶山市':[104.220273,23.409709],
            '许昌市':[113.898141,34.055312],
            '乌海市':[106.817642,39.674447],
            '怀化市':[109.988967,27.561327],
            '海东市':[102.098368,36.513617],
            '漯河市':[114.01652,33.586267],
            '娄底市':[112.007827,27.707813],
            '毕节市':[105.29514,27.290214],
            '延安市':[109.634559,36.675447],
            '遵义市':[106.929977,27.735282],
            '泉州市':[118.621503,24.921379],
            '六安市':[116.520663,31.740469],
            '淮南市':[117.008686,32.629415],
            '景德镇市':[117.222518,29.342781],
            '广安市':[106.638404,30.463739],
            '九江市':[116.015582,29.713849],
            '岳阳市':[113.138363,29.365695],
            '廊坊市':[116.690577,39.542922],
            '马鞍山市':[118.518755,31.679707],
            '湘西土家族苗族自治州':[109.730632,28.297014],
            '襄阳市':[112.129683,32.018226],
            '陵水黎族自治县':[110.041015,18.542497],
            '陇南市':[104.927428,33.405657],
            '淮北市':[116.805111,33.960699],
            '安庆市':[117.067058,30.533943],
            '甘南藏族自治州':[102.911263,34.988666],
            '赣州市':[114.949707,25.838298],
            '鄂尔多斯市':[109.896675,39.627378],
            '葫芦岛市':[120.849723,40.716926],
            '乐山市':[103.786913,29.55794],
            '运城市':[111.009935,35.033179],
            '忻州市':[112.731421,38.424644],
            '随州市':[113.400946,31.69455],
            '濮阳市':[115.039042,35.769936],
            '抚州市':[116.365687,27.955914],
            '汉中市':[107.025977,33.076704],
            '株洲市':[113.138174,27.833568],
            '宜春市':[114.418386,27.821367],
            
            "上海市":[121.4878995,31.24916171],
		    "临沧市":[100.0926129,23.8878061],
		    "丽江市":[100.2296284,26.87535109],
		    "保山市":[99.17799561,25.1204892],
		    "大理白族自治州":[100.2236748,25.59689964],
		    "德宏傣族景颇族自治州":[98.58943429,24.44123966],
		    "怒江傈僳族自治州":[98.85993204,25.86067698],
		    "文山壮族苗族自治州":[104.2462943,23.37408685],
		    "昆明市":[102.7146011,25.0491531],
		    "昭通市":[103.7250207,27.34063296],
		    "普洱市":[100.9800577,22.78877778],
		    "曲靖市":[103.7825389,25.52075814],
		    "楚雄彝族自治州":[101.5293822,25.06635567],
		    "玉溪市":[102.5450679,24.37044713],
		    "红河哈尼族彝族自治州":[103.3840648,23.36771752],
		    "西双版纳傣族自治州":[100.8030383,22.009433],
		    "迪庆藏族自治州":[99.7136816,27.83102946],
		    "乌兰察布市":[113.1128464,41.02236295],
		    "乌海市":[106.8319991,39.68317701],
		    "兴安盟":[122.0481665,46.08375707],
		    "包头市":[109.8462385,40.64711943],
		    "呼伦贝尔市":[119.7608218,49.20163605],
		    "呼和浩特市":[111.6603505,40.82831887],
		    "巴彦淖尔市":[107.4238067,40.7691799],
		    "赤峰市":[118.9307612,42.29711232],
		    "通辽市":[122.2603633,43.63375607],
		    "鄂尔多斯市":[109.9937063,39.81648956],
		    "锡林郭勒盟":[116.0273397,43.93970484],
		    "阿拉善盟":[105.6956829,38.84307526],
		    "北京市":[116.395645,39.92998578],
		    "台中市":[119.3376341,26.09119371],
		    "台北市":[114.1304744,22.37483293],
		    "台南市":[121.3605259,38.96584479],
		    "嘉义市":[114.2467013,22.72886572],
		    "高雄市":[111.5909528,21.94648225],
		    "吉林市":[126.564544,43.87198833],
		    "四平市":[124.3913821,43.1755247],
		    "延边朝鲜族自治州":[129.485902,42.8964136],
		    "松原市":[124.8329945,45.13604897],
		    "白城市":[122.8407767,45.62108628],
		    "白山市":[126.4357977,41.9458594],
		    "辽源市":[125.1336861,42.92330262],
		    "通化市":[125.9426501,41.73639713],
		    "长春市":[125.3136424,43.89833761],
		    "乐山市":[103.7608242,29.60095761],
		    "内江市":[105.073056,29.59946153],
		    "凉山彝族自治州":[102.2595908,27.8923929],
		    "南充市":[106.105554,30.80096517],
		    "宜宾市":[104.6330191,28.7696748],
		    "巴中市":[106.7579158,31.86918916],
		    "广元市":[105.8196869,32.44104016],
		    "广安市":[106.6357203,30.46398389],
		    "德阳市":[104.4023978,31.13113965],
		    "成都市":[104.0679235,30.67994285],
		    "攀枝花市":[101.7224232,26.58757126],
		    "泸州市":[105.4439703,28.8959298],
		    "甘孜藏族自治州":[101.9692321,30.05514411],
		    "眉山市":[103.8414296,30.06111508],
		    "绵阳市":[104.705519,31.50470126],
		    "自贡市":[104.7760713,29.35915689],
		    "资阳市":[104.6359303,30.13219143],
		    "达州市":[107.4949734,31.21419886],
		    "遂宁市":[105.5648878,30.55749135],
		    "阿坝藏族羌族自治州":[102.2285647,31.90576286],
		    "雅安市":[103.0093565,29.99971634],
		    "天津市":[117.2108131,39.1439299],
		    "中卫市":[105.1967542,37.52112419],
		    "吴忠市":[106.2082542,37.993561],
		    "固原市":[106.285268,36.02152348],
		    "石嘴山市":[106.3793372,39.02022328],
		    "银川市":[106.2064786,38.50262101],
		    "亳州市":[115.7879282,33.87121057],
		    "六安市":[116.5052527,31.75555836],
		    "合肥市":[117.2826991,31.86694226],
		    "安庆市":[117.0587388,30.53789782],
		    "宣城市":[118.7520963,30.95164235],
		    "宿州市":[116.9886924,33.63677239],
		    "池州市":[117.4944768,30.66001925],
		    "淮北市":[116.7914474,33.96002331],
		    "淮南市":[117.0186389,32.64281182],
		    "滁州市":[118.3245704,32.3173506],
		    "芜湖市":[118.3841084,31.36601979],
		    "蚌埠市":[117.3570799,32.92949891],
		    "铜陵市":[117.8194287,30.94092969],
		    "阜阳市":[115.8209323,32.90121133],
		    "马鞍山市":[118.5158818,31.68852816],
		    "黄山市":[118.2935696,29.73443486],
		    "东营市":[118.5839263,37.48712116],
		    "临沂市":[118.3407682,35.07240907],
		    "威海市":[122.0939584,37.52878708],
		    "德州市":[116.3281614,37.46082593],
		    "日照市":[119.5071799,35.42022519],
		    "枣庄市":[117.2793054,34.80788308],
		    "泰安市":[117.0894149,36.18807776],
		    "济南市":[117.0249671,36.68278473],
		    "济宁市":[116.6007976,35.40212166],
		    "淄博市":[118.0591343,36.80468485],
		    "滨州市":[117.9682924,37.40531394],
		    "潍坊市":[119.1426338,36.71611487],
		    "烟台市":[121.309555,37.53656156],
		    "聊城市":[115.9868691,36.45582851],
		    "莱芜市":[117.6846669,36.23365413],
		    "菏泽市":[115.4633598,35.2624405],
		    "青岛市":[120.3844282,36.1052149],
		    "临汾市":[111.5387876,36.09974544],
		    "吕梁市":[111.1431566,37.5273161],
		    "大同市":[113.2905087,40.1137445],
		    "太原市":[112.5508636,37.89027705],
		    "忻州市":[112.7279388,38.46103057],
		    "晋中市":[112.7385144,37.69336153],
		    "晋城市":[112.8673328,35.49983447],
		    "朔州市":[112.4799277,39.33767197],
		    "运城市":[111.0068537,35.03885948],
		    "长治市":[113.1202921,36.20166439],
		    "阳泉市":[113.5692376,37.86952949],
		    "东莞市":[113.763434,23.04302382],
		    "中山市":[113.42206,22.54517751],
		    "云浮市":[112.050946,22.93797569],
		    "佛山市":[113.1340256,23.03509484],
		    "广州市":[113.3076497,23.1200491],
		    "惠州市":[114.4106581,23.11353985],
		    "揭阳市":[116.3795009,23.54799947],
		    "梅州市":[116.1264031,24.30457061],
		    "汕头市":[116.7286503,23.38390845],
		    "汕尾市":[115.3729243,22.7787305],
		    "江门市":[113.0781253,22.57511678],
		    "河源市":[114.7137215,23.75725085],
		    "深圳市":[114.0259737,22.54605355],
		    "清远市":[113.0407733,23.69846855],
		    "湛江市":[110.3650673,21.2574631],
		    "潮州市":[116.630076,23.66181168],
		    "珠海市":[113.562447,22.25691465],
		    "肇庆市":[112.4796534,23.07866328],
		    "茂名市":[110.9312453,21.66822572],
		    "阳江市":[111.9770098,21.8715173],
		    "韶关市":[113.5944611,24.80296031],
		    "北海市":[109.1226279,21.47271824],
		    "南宁市":[108.2972336,22.80649294],
		    "崇左市":[107.357322,22.4154553],
		    "来宾市":[109.2318165,23.74116593],
		    "柳州市":[109.4224018,24.32905335],
		    "桂林市":[110.2609201,25.26290125],
		    "梧州市":[111.305472,23.48539464],
		    "河池市":[108.0699477,24.69952078],
		    "玉林市":[110.1516763,22.64397361],
		    "百色市":[106.6318214,23.90151237],
		    "贵港市":[109.6137076,23.10337316],
		    "贺州市":[111.5525942,24.41105355],
		    "钦州市":[108.6387981,21.97335047],
		    "防城港市":[108.3517912,21.61739847],
		    "乌鲁木齐市":[87.56498774,43.84038035],
		    "伊犁哈萨克自治州":[81.29785353,43.9222481],
		    "克孜勒苏柯尔克孜自治州":[76.13756448,39.75034558],
		    "克拉玛依市":[84.88118019,45.59433107],
		    "博尔塔拉蒙古自治州":[82.05243627,44.91365137],
		    "吐鲁番地区":[89.18159487,42.96047002],
		    "和田地区":[79.93023864,37.11677449],
		    "哈密地区":[93.52835509,42.85859633],
		    "喀什地区":[75.99297327,39.47062719],
		    "塔城地区":[82.97488058,46.75868363],
		    "昌吉回族自治州":[87.29603813,44.0070579],
		    "自治区直辖":[85.61489934,42.12700096],
		    "阿克苏地区":[80.26984618,41.1717309],
		    "阿勒泰地区":[88.13791549,47.83974449],
		    "南京市":[118.7780744,32.0572355],
		    "南通市":[120.873801,32.01466454],
		    "宿迁市":[118.2968934,33.95204973],
		    "常州市":[119.981861,31.77139674],
		    "徐州市":[117.1881066,34.27155343],
		    "扬州市":[119.4277776,32.40850525],
		    "无锡市":[120.3054559,31.57003745],
		    "泰州市":[119.919606,32.47605327],
		    "淮安市":[119.0301864,33.60651274],
		    "盐城市":[120.1488718,33.37986188],
		    "苏州市":[120.6199071,31.31798737],
		    "连云港市":[119.1738722,34.60154897],
		    "镇江市":[119.4558354,32.20440944],
		    "九江市":[115.999848,29.71963953],
		    "南昌市":[115.8935275,28.689578],
		    "吉安市":[114.9920387,27.11384765],
		    "宜春市":[114.4000387,27.8111299],
		    "抚州市":[116.3609189,27.95454517],
		    "新余市":[114.9471174,27.82232156],
		    "景德镇市":[117.1865226,29.30356277],
		    "萍乡市":[113.859917,27.63954422],
		    "赣州市":[114.9359091,25.84529554],
		    "鹰潭市":[117.0354502,28.2413096],
		    "保定市":[115.4948102,38.88656455],
		    "唐山市":[118.1834506,39.65053092],
		    "廊坊市":[116.7036022,39.51861063],
		    "张家口市":[114.8937815,40.81118849],
		    "承德市":[117.9338225,40.99252105],
		    "沧州市":[116.8638065,38.29761535],
		    "石家庄市":[114.5220818,38.04895831],
		    "秦皇岛市":[119.6043676,39.94546157],
		    "衡水市":[115.6862287,37.74692905],
		    "邢台市":[114.5204868,37.0695312],
		    "邯郸市":[114.4826939,36.60930793],
		    "三门峡市":[111.1812621,34.78331994],
		    "信阳市":[114.085491,32.12858231],
		    "南阳市":[112.5428419,33.01141957],
		    "周口市":[114.6541019,33.62374082],
		    "商丘市":[115.6418857,34.43858864],
		    "安阳市":[114.3518065,36.11026672],
		    "平顶山市":[113.300849,33.74530146],
		    "开封市":[114.3516421,34.80185418],
		    "新乡市":[113.9126902,35.30725756],
		    "洛阳市":[112.4475248,34.65736782],
		    "漯河市":[114.0460614,33.57627869],
		    "濮阳市":[115.0266274,35.75329789],
		    "焦作市":[113.2118359,35.23460756],
		    "许昌市":[113.8353125,34.02673959],
		    "郑州市":[113.6496439,34.75661006],
		    "驻马店市":[114.0491535,32.98315815],
		    "鹤壁市":[114.2977698,35.75542587],
		    "三亚市":[109.5227713,18.25777591],
		    "三沙市":[112.3503831,16.84006289],
		    "海口市":[110.3308018,20.02207128],
		    "十堰市":[110.8012289,32.63699434],
		    "咸宁市":[114.3000606,29.88065676],
		    "孝感市":[113.9357344,30.92795478],
		    "宜昌市":[111.3109811,30.73275782],
		    "恩施土家族苗族自治州":[109.4919233,30.28588832],
		    "武汉市":[114.3162001,30.58108413],
		    "荆州市":[112.2418658,30.33259052],
		    "荆门市":[112.2173303,31.0426112],
		    "襄阳市":[112.2500928,32.22916859],
		    "鄂州市":[114.895594,30.38443932],
		    "随州市":[113.3793584,31.71785761],
		    "黄冈市":[114.906618,30.44610894],
		    "黄石市":[115.0506832,30.21612713],
		    "娄底市":[111.9963964,27.7410733],
		    "岳阳市":[113.1461955,29.37800708],
		    "常德市":[111.6537181,29.01214886],
		    "张家界市":[110.4816202,29.12488935],
		    "怀化市":[109.9869588,27.5574829],
		    "株洲市":[113.1316953,27.82743293],
		    "永州市":[111.6146477,26.43597165],
		    "湘潭市":[112.9355556,27.83509505],
		    "湘西土家族苗族自治州":[109.7457458,28.31795079],
		    "益阳市":[112.3665466,28.58808778],
		    "衡阳市":[112.5838188,26.89816442],
		    "邵阳市":[111.4615254,27.23681124],
		    "郴州市":[113.0377045,25.78226398],
		    "长沙市":[112.9793528,28.21347823],
		    "澳门特别行政区":[113.5664323,22.19500416],
		    "临夏回族自治州":[103.2152492,35.59851435],
		    "兰州市":[103.8233054,36.06422553],
		    "嘉峪关市":[98.28163459,39.80239733],
		    "天水市":[105.7369316,34.58431942],
		    "定西市":[104.6266376,35.58605624],
		    "平凉市":[106.6889112,35.55011019],
		    "庆阳市":[107.6442271,35.72680075],
		    "张掖市":[100.4598919,38.9393203],
		    "武威市":[102.6401473,37.93317214],
		    "甘南藏族自治州":[102.9174425,34.99221118],
		    "白银市":[104.1712409,36.54668171],
		    "酒泉市":[98.50841451,39.74147377],
		    "金昌市":[102.2081263,38.5160718],
		    "陇南市":[104.9345734,33.39447997],
		    "三明市":[117.6421939,26.27083528],
		    "南平市":[118.1818829,26.64362647],
		    "厦门市":[118.103886,24.48923061],
		    "宁德市":[119.5420822,26.65652742],
		    "泉州市":[118.6003623,24.90165238],
		    "漳州市":[117.6762047,24.51706478],
		    "福州市":[119.3302211,26.0471255],
		    "莆田市":[119.077731,25.44845014],
		    "龙岩市":[117.0179967,25.07868543],
		    "山南地区":[91.75064387,29.22902693],
		    "拉萨市":[91.1118909,29.66255706],
		    "日喀则地区":[88.89148557,29.2690232],
		    "昌都地区":[97.18558158,31.14057563],
		    "林芝地区":[94.34998546,29.66694063],
		    "那曲地区":[92.06701837,31.48067983],
		    "阿里地区":[81.10766869,30.40455659],
		    "六盘水市":[104.8520868,26.59186606],
		    "安顺市":[105.92827,26.22859458],
		    "毕节市":[105.3333234,27.40856213],
		    "贵阳市":[106.7091771,26.62990674],
		    "遵义市":[106.9312603,27.69996138],
		    "铜仁市":[109.168558,27.67490269],
		    "黔东南苗族侗族自治州":[107.9853526,26.58399177],
		    "黔南布依族苗族自治州":[107.5232051,26.264536],
		    "黔西南布依族苗族自治州":[104.9005578,25.09514806],
		    "丹东市":[124.3385431,40.12902283],
		    "大连市":[121.5934778,38.94870994],
		    "抚顺市":[123.9298198,41.87730383],
		    "朝阳市":[120.4461627,41.57182767],
		    "本溪市":[123.7780624,41.32583763],
		    "沈阳市":[123.4327909,41.80864478],
		    "盘锦市":[122.0732278,41.14124802],
		    "营口市":[122.2333914,40.66865107],
		    "葫芦岛市":[120.8607576,40.74302988],
		    "辽阳市":[123.1724512,41.27333927],
		    "铁岭市":[123.8548496,42.29975701],
		    "锦州市":[121.1477487,41.13087888],
		    "阜新市":[121.6608221,42.01925011],
		    "鞍山市":[123.0077633,41.11874368],
		    "重庆市":[106.530635,29.54460611],
		    "咸阳市":[108.7075093,34.345373],
		    "商洛市":[109.9342082,33.8739074],
		    "安康市":[109.0380446,32.70437045],
		    "宝鸡市":[107.1706455,34.36408081],
		    "延安市":[109.5005098,36.60332035],
		    "榆林市":[109.7459257,38.27943924],
		    "汉中市":[107.0454776,33.08156898],
		    "渭南市":[109.4839327,34.50235798],
		    "西安市":[108.9530983,34.2777999],
		    "铜川市":[108.968067,34.9083677],
		    "果洛藏族自治州":[100.2237228,34.48048458],
		    "海东地区":[102.085207,36.51761017],
		    "海北藏族自治州":[100.8798022,36.9606541],
		    "海南藏族自治州":[100.6240661,36.2843638],
		    "海西蒙古族藏族自治州":[97.34262542,37.37379907],
		    "玉树藏族自治州":[97.01331614,33.00623991],
		    "西宁市":[101.767921,36.64073861],
		    "黄南藏族自治州":[102.0076003,35.52285155],
		    "香港岛":[114.1838705,22.27210343],
		    "香港特别行政区":[114.1838705,22.27210343],
		    "七台河市":[131.019048,45.77500537],
		    "伊春市":[128.910766,47.73468508],
		    "佳木斯市":[130.2847346,46.8137796],
		    "双鸭山市":[131.1714017,46.65510206],
		    "哈尔滨市":[126.6577169,45.77322463],
		    "大兴安岭地区":[124.1961042,51.99178897],
		    "大庆市":[125.0218397,46.59670902],
		    "牡丹江市":[129.6080354,44.58852115],
		    "绥化市":[126.9890946,46.64606393],
		    "鸡西市":[130.9417673,45.32153989],
		    "鹤岗市":[130.2924721,47.3386659],
		    "黑河市":[127.5008303,50.25069009],
		    "齐齐哈尔市":[123.9872889,47.34769981]
        },
        BJData:[
            [{name: this.placeName}, {name: '北京', value: 95}],
        ],
        GUANG:[
            [{name: this.placeName}, {name: '长春', value: 40}],

        ],
        SHData:[
            [{name: this.placeName}, {name: '深圳', value: 10}],

        ],
        SHENZHEN:[
            [{name: this.placeName}, {name: '成都', value: 10}],
        ],
        XIAN:[
            [{name: this.placeName}, {name: '上海', value: 95}],
        ],
        FENGD:[
            [{name: this.placeName}, {name: '重庆', value: 20}]
        ],

    }
    },
    computed: {
    	yearNumbs(){
			return Rw.string_until.addPoint(this.yearNumb)
		},
		mouthNumbs(){
			return Rw.string_until.addPoint(this.mouthNumb)
		},
    },
    watch:{
    	range:function(){
    		this.getData();
    	},
    	code:function(){
    		this.getData();
    	}
    },
    methods: {
  	getData(){
			api.params.code = this.code;
			//console.log(this.code)
			api.params.range = this.range;
	  		api.touristSum(api.params).then( (re) =>{
	    		let reData = re.data.data;
	    		this.yearNumb = reData.yearSum;
	    		this.mouthNumb = reData.monthSum;
	    		let topCity = reData.topCity;
	    		this.allData=[];
	    		this.zhejiang=[];
	    		
				for(let i=0; i<topCity.length; ++i){
					if(topCity[i]._id!=="Missing" &&　topCity[i]._id!=="总计"){
						//alert(topCity[i]._id!=="missing")
						if(this.range===1){
							if(topCity[i].sum>0){
								this.allData[i]=["浦江县", [[{name: "浦江县"}, {name: topCity[i]._id, value: topCity[i].sum}]]]
							}
						}else{
							if(topCity[i].sum>0){
								this.zhejiang[i]=["浦江县", [[{name: "浦江县"}, {name: topCity[i]._id, value: topCity[i].sum}]]]
							}
						}
					}
					
				}
				this.allData.push(["浦江县", [[{name: "浦江县"}, {name: "浦江县", value: '来源'}]]])
				this.zhejiang.push(["浦江县", [[{name: "浦江县"}, {name: "浦江县", value: '来源'}]]])
				
	    		if(re.data.code===200 || re.data.code==='200'){
	    			this.isloading=false;
	    			delete api.params.range;
	    		}
	    		if(this.range===1){
	    			this.redomData();
	    		}else{
	    			this.redomaaData();
	    		}
				
				
		    }).catch( (e) => {
		    	console.log(e);
		    })
		
  	},
    redom7(){
        this.range = 2;
    },
    redom14(){
        this.range = 1;
    },
    convertData(data){
         var res = [];
	    for (var i = 0; i < data.length; i++) {
	        var dataItem = data[i];
	        var fromCoord = this.geoCoordMap[dataItem[1].name];
            var toCoord = this.geoCoordMap[dataItem[0].name];
	        var val = dataItem[1].value;
	        if (fromCoord && toCoord) {
	            res.push({
	                fromName: dataItem[1].name,
	                toName: dataItem[0].name,
	                coords: [fromCoord, toCoord,val]
	            });
	        }
	    }
	    return res;
    },
    redom(){
            if(this.chart){
                this.chart.dispose();
            }
            let _self=this
            this.isActive = true;
            this.$nextTick(()=>{
                var dom = document.getElementById("fromEchart");
                this.chart = echarts.init(dom);
                if (this.optionChina && typeof this.optionChina === "object") {
                this.chart.setOption(this.optionChina, true);
                }
            }
            )
            
        
        },
        redomaa(){
            if(this.chart){
                this.chart.dispose();
            }
            let _self=this
            echarts.registerMap('zhejiang', zhejiangJson);
            this.isActive = true;
            this.$nextTick(()=>{
                var dom = document.getElementById("fromEchart");
                this.chart = echarts.init(dom);
                if (this.option && typeof this.option === "object") {
                this.chart.setOption(this.option, true);
                }
            }
            )
            //this.redomaaData();
        
        },
    //国内游客来源
    redomData(){
    	this.range = 1;
    	this.isActive=true;
        let _self=this;
        const target = this.placeName;
        if(this.chart){
            this.chart.dispose();
        }
        var dom = document.getElementById("fromEchart");
        this.chart = echarts.init(dom);
        var color =['#C184FF','#F95AFD','#5AA7FD','#555FFF','#5AFDD1','#58E5E1','#FFCD38','#FFFD85','#FF8885','#FF43A3'];
        var series = [];
         
        this.allData.forEach(function (item, i) {
            series.push(
                {
                    name: item[0],
                    type: 'lines',
                    zlevel: 1,
                    symbol:'circle',
                    effect: {
                        show: true,
                        period: 6,
                        trailLength: 0.7,
                        color: '#0d1f6d',
                        symbolSize: 3
                    },
                    lineStyle: {
                        normal: {
                            color: color[i],
                            width: 0,
                            //迁徙轨迹弧度
                            curveness: 0.2
                        }
                    },
                    progressiveThreshold: 300,
                    progressive: 200,
                    data: _self.convertData(item[1])
                },
                {
                    name: item[0],
                    type: 'lines',
                    zlevel: 2,
                    largeThreshold:200,
                    large:true,
                    symbol: ['none', 'arrow'],
                    //箭头大小
                    symbolSize: 2,
                    effect: {
                        show: true,
                        period: 6,
                        trailLength: 0,
                        //小飞机
                        symbol: planePath,
                        //移动点大小
                        symbolSize: 15*w
                    },
                    lineStyle: {
                        normal: {
                            color: _self.color[i],
                            width: 2,
                            opacity: 0.6,
                            curveness: 0.2
                        }
                    },
                    progressiveThreshold: 500,
                    progressive: 200,
                    data: _self.convertData(item[1])
                },
                {
                    name: item[0],
                    type: 'effectScatter',
                    coordinateSystem: 'geo',
                    zlevel: 2,
                    rippleEffect: {
                        period: 4,
						scale: 5,
						brushType: 'stroke',
                    },
                    label: {
                        normal: {
                            show: true ,
                            position: 'right',
                            formatter: '{b}',
                            textStyle: {
                                fontSize: '70%'
                            }
                        }
                    },
                    symbolSize: function (val) {
                        return 10*w;
                    },
                    itemStyle: {
                        normal: {
                            color: _self.color[i]
                        }
                    },
                    progressiveThreshold: 500,
                    progressive: 200,
                    data: item[1].map(function (dataItem) {
                        return {
                            name: dataItem[1].name,
                            value: _self.geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
                        };
                    })
                });
        });
        this.optionChina.series = series;
        if (this.optionChina && typeof this.optionChina === "object") {
           this.chart.setOption(this.optionChina, true);
        }
    },
    //省内游客来源
    redomaaData(){
    	this.range = 2;
    	this.isActive=false;
        if(this.chart){
            this.chart.dispose();
        }
        let _self=this
        this.isActive=false;
         echarts.registerMap('zhejiang', zhejiangJson);
        var dom = document.getElementById('fromEchart');
        this.chart = echarts.init(dom);
        var color =['#C184FF','#F95AFD','#5AA7FD','#555FFF','#5AFDD1','#58E5E1','#FFCD38','#FFFD85','#FF8885','#FF43A3'];
        var series = [];
        
        this.zhejiang.forEach(function (item, i) {
            series.push(
                {
//                  name: item[0],
                    type: 'lines',
                    zlevel: 1,
                    symbol:'circle',
                    effect: {
                        show: true,
                        period: 6,
                        trailLength: 0,
                        color: '#0d1f6d',
                        symbolSize: 3
                    },
                    lineStyle: {
                        normal: {
                            color: color[i],
                            width: 0,
                            //迁徙轨迹弧度
                            curveness: 0.2
                        }
                    },
                    progressiveThreshold: 500,
                    progressive: 200,
                    data: _self.convertData(item[1])
                },
                {
//                  name: item[0],
                    type: 'lines',
                    zlevel: 2,
                    symbol: ['none', 'arrow'],
                    //箭头大小
                    symbolSize: 12,
                    effect: {
                        show: true,
                        period: 5,
                        trailLength: 0,
                        //小飞机
                        symbol: planePath,
                        //移动点大小
                        symbolSize: 15*w
                    },
                    progressiveThreshold: 500,
                    progressive: 200,
                    lineStyle: {
                        normal: {
                            color: _self.color[i],
                            width: 2,
                            opacity: 0.6,
                            curveness: 0.2
                        }
                    },
                    data: _self.convertData(item[1])
                },
                {
                    name: item[0],
                    type: 'effectScatter',
                    coordinateSystem: 'geo',
                    zlevel: 2,
                    rippleEffect: {
                        period: 4,
						scale: 5,
						brushType: 'stroke',
                    },
                    label: {
                        normal: {
                            show: true ,
                            position: 'right',
                            formatter: '{b}',
                            textStyle: {
                                fontSize: '70%'
                            }
                        }
                    },
                    symbolSize: function (val) {
                    	return 10*w
                        
                    },
                    itemStyle: {
                        normal: {
                            color: _self.color[i]
                        }
                    },
                    progressiveThreshold: 50,
                    progressive: 200,
                    data: item[1].map(function (dataItem) {
                        return {
                            name: dataItem[1].name,
                            value: _self.geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
                        };
                    })
                });
        });
        this.option.series = series;
        if (this.option && typeof this.option === "object") {
           this.chart.setOption(this.option, true);
        }

    }
    },
    created(){
    },
    mounted(){
        this.$nextTick(echarts_resize('fromEchart',this))
    },
}
</script>

<style lang="less" scoped>
.map_content {
  width: 100%;
  height: 100%;
  position: relative;
  top: 5%;
  .loading{
  	top: -5%;
  }
  .topTitle{
            position: absolute;
            top:-6px;
            span{
                color: #43dbff;
                font-size: .8rem;
            }
            font{
                margin-top: 10px;
                display: block;
                color: #ffe200;
                font-size: 1.2rem;
                font-family: numberFont;
            }
        }
        
        .topTitle:nth-child(2){
        	right: 26%;
        	span{
                color: #43dbff;
                font-size: .8rem;
                
            }
        }
        
        .topTitle:nth-child(1){
        	left: 26%;
        	span{
                color: #43dbff;
                font-size: .8rem;
                
            }
        }
}
#fromEchart{
    width:100%;
    height:100%;
    top: -5%;
}
.week{
    height: 1.5rem !important;
    width: 7rem !important;
    position: absolute;
    bottom: 8%;
    right: 40%;
    font-size:.8rem;
    &:after {
        content: ".";
        display: block;
        height: 0;
        clear: both;
        visibility: hidden;
        line-height: 25px;
     }
    .oneweek{
      cursor: pointer;
      float: left;
      -webkit-user-select: none;
      -ms-user-select: none;
      -moz-user-select: none;
      height: 1.5rem;
      line-height:1.5rem;
      width: 47%;
      color: #abb5d3;
      background-image:url('../../../assets/images/home/透明框—国内.png');
      background-size: 100% 100%;
      &.chose{
        background-image:url('../../../assets/images/home/透明框—省内.png');
          background-size: 100% 100%;
          color:#d3ddf9;
      }
      &:hover{
		box-shadow: 0 0 1.5rem  rgba(1,1,13,0.6);
      }
    }
    .twoweek{
      cursor: pointer;
      float: right;
      -webkit-user-select: none;
      -ms-user-select: none;
      -moz-user-select: none;
      height: 1.5rem;
      line-height:1.5rem;
      width: 47%;
      color: #abb5d3;
      background-image:url('../../../assets/images/home/透明框—国内.png');
      background-size: 100% 100%;
      &.chose{
        background-image:url('../../../assets/images/home/透明框—省内.png');
          background-size: 100% 100%;
          color:#d3ddf9;
      }
      &:hover{
		box-shadow: 0 0 1.5rem  rgba(1,1,13,0.6);
      }
    }
  }
</style>
